In [1]:
import pandas as pd
import numpy as np
import scipy.stats as stats

In [2]:
#disaggregated 2019 science CMAS data
df_disag = pd.read_excel('2019 CMAS Science Disaggregated District and School Achievement Results.xlsx')
#2019 science CMAS data by school and district
df_sch_dist = pd.read_excel('2019 CMAS Science District and School Achievement Results.xlsx')

In [4]:
df_disag.shape

(9343, 23)

In [5]:
df_disag.columns

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13',
       'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17',
       'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21',
       'Unnamed: 22'],
      dtype='object')

In [6]:
df_disag.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9343 entries, 0 to 9342
Data columns (total 23 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   9338 non-null   object
 1   Unnamed: 1   9333 non-null   object
 2   Unnamed: 2   9333 non-null   object
 3   Unnamed: 3   9333 non-null   object
 4   Unnamed: 4   9333 non-null   object
 5   Unnamed: 5   9333 non-null   object
 6   Unnamed: 6   9333 non-null   object
 7   Unnamed: 7   9334 non-null   object
 8   Unnamed: 8   9333 non-null   object
 9   Unnamed: 9   9333 non-null   object
 10  Unnamed: 10  9333 non-null   object
 11  Unnamed: 11  9334 non-null   object
 12  Unnamed: 12  9334 non-null   object
 13  Unnamed: 13  9334 non-null   object
 14  Unnamed: 14  9333 non-null   object
 15  Unnamed: 15  9333 non-null   object
 16  Unnamed: 16  9333 non-null   object
 17  Unnamed: 17  9333 non-null   object
 18  Unnamed: 18  9333 non-null   object
 19  Unnamed: 19  9333 non-null   object
 20  Unnamed: 20  9333 non-null   object
 21  Unnamed: 21  9333 non-null   object
 22  Unnamed: 22  9333 non-null   object
dtypes: object(23)
memory usage: 1.6+ MB

In [8]:
df_disag.describe()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22
count,9338,9333,9333,9333,9333,9333,9333,9334,9333,9333,...,9334,9333,9333,9333,9333,9333,9333,9333,9333,9333
unique,9,187,187,1786,1711,5,3,494,438,252,...,287,706,292,443,242,378,102,192,266,697
top,School,0880,DENVER COUNTY 1,0000,All Schools,All Grades,Male,- -,< 16,- -,...,- -,- -,- -,- -,- -,- -,- -,- -,- -,- -
freq,7869,844,844,1463,1463,3923,4671,2391,2391,2391,...,4133,4133,5080,5080,8254,8254,8254,8254,4040,4040

In [9]:
df_sch_dist.shape

(4717, 26)

In [10]:
df_sch_dist.columns

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13',
       'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17',
       'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21',
       'Unnamed: 22', 'Unnamed: 23', 'Unnamed: 24', 'Unnamed: 25'],
      dtype='object')

In [11]:
df_sch_dist.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4717 entries, 0 to 4716
Data columns (total 26 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   4711 non-null   object
 1   Unnamed: 1   4706 non-null   object
 2   Unnamed: 2   4706 non-null   object
 3   Unnamed: 3   4706 non-null   object
 4   Unnamed: 4   4706 non-null   object
 5   Unnamed: 5   4706 non-null   object
 6   Unnamed: 6   4707 non-null   object
 7   Unnamed: 7   4706 non-null   object
 8   Unnamed: 8   4706 non-null   object
 9   Unnamed: 9   4706 non-null   object
 10  Unnamed: 10  4708 non-null   object
 11  Unnamed: 11  4706 non-null   object
 12  Unnamed: 12  4596 non-null   object
 13  Unnamed: 13  4709 non-null   object
 14  Unnamed: 14  4706 non-null   object
 15  Unnamed: 15  4706 non-null   object
 16  Unnamed: 16  4706 non-null   object
 17  Unnamed: 17  4706 non-null   object
 18  Unnamed: 18  4706 non-null   object
 19  Unnamed: 19  4706 non-null   object
 20  Unnamed: 20  4706 non-null   object
 21  Unnamed: 21  4706 non-null   object
 22  Unnamed: 22  4706 non-null   object
 23  Unnamed: 23  4596 non-null   object
 24  Unnamed: 24  4595 non-null   object
 25  Unnamed: 25  4637 non-null   object
dtypes: object(26)
memory usage: 958.3+ KB

In [12]:
df_sch_dist.describe()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25
count,4711,4706,4706,4706,4706,4706,4707,4706,4706,4706,...,4706,4706,4706,4706,4706,4706,4706,4596,4595,4637
unique,9,187,187,1786,1711,5,518,453,247,421,...,417,231,409,94,182,256,654,269,659,419
top,SCHOOL,0880,DENVER COUNTY 1,0000,All Schools,All Grades,- -,< 16,0,100.0,...,- -,- -,- -,- -,- -,- -,- -,- -,- -,- -
freq,3967,427,427,738,738,1970,668,668,864,864,...,1457,3458,3458,3458,3458,1202,1202,1287,1287,1479